/*
 给一个数组 nums 写一个函数将 0 移动到数组的最后面，非零元素保持原数组的顺序
 
//                                  _oo8oo_
//                                 o8888888o
//                                888&&&&&888
//                                 (| -_- |)
//                                 0\  =  /0
//                               ___/&#039;\___
//                             .&#039; \\|     |
//                            / \\|||  :  |||// \
//                           / _||||| -:- |||||_ \
//                          |   | \\\  -  /// |   |
//                         | \_|  &#039;&#039; |_/ |
//                         \  .-\__  &#039;  __/-.  /
//                       ___&#039;.  &#039;   .&#039;___
//                    .&quot;&quot;  &#039;   &quot;&quot;.
//                    | | :  `- \`.:`\ _ /`:.`/ -`  : | |
//                    \  \ `-.   \_ __\ /__ _/   .-` /  /
//                =====`-.____`.___ \_____/ ___.`____.-`=====
//                                 `=---=`
//  
//  
//               ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
// 
//                          佛祖保佑         永不宕机/永无bug
//                                             By YJWen
 */


namespace MoveZero
{
    using System.Collections.Generic;

    public class Program
    {

        private static void Main(string[] args)
        {
            int[] nums = { 0, 1, 0, 3, 12, 0 };
            MoveZero movezero = new MoveZero();
            var a = movezero.MoveZeroes(nums);
        }
    }
}